ErrorChen/SensorArray/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOARD_I2C_FREQ_HZ=325000
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# SensorArray ESP32-S3 default high-speed embedded firmware path.
CONFIG_SENSORARRAY_APP_MODE_PIEZO_READ=y
# CONFIG_SENSORARRAY_APP_MODE_RESISTANCE_READ is not set
# CONFIG_SENSORARRAY_APP_MODE_DEBUG is not set
CONFIG_SENSORARRAY_VOLTAGE_SCAN_PROFILE_FAST=y
# CONFIG_SENSORARRAY_VOLTAGE_SCAN_PROFILE_SAFE is not set
# CONFIG_SENSORARRAY_VOLTAGE_SCAN_PROFILE_MAX is not set
CONFIG_SENSORARRAY_OUTPUT_FORMAT_BINARY=y
# CONFIG_SENSORARRAY_OUTPUT_FORMAT_CSV is not set
# CONFIG_SENSORARRAY_OUTPUT_FORMAT_BOTH is not set
CONFIG_SENSORARRAY_VOLTAGE_SCAN_CSV_EVERY_N=0
CONFIG_SENSORARRAY_SCAN_USE_DEDICATED_TASKS=y
CONFIG_SENSORARRAY_STREAM_QUEUE_DEPTH=16
CONFIG_SENSORARRAY_USB_STDOUT_NONBLOCKING=y
CONFIG_SENSORARRAY_AUTO_RATE_CONTROL=y
CONFIG_SENSORARRAY_AUTO_RATE_CONTROL_OUTPUT_FIRST=y
CONFIG_SENSORARRAY_ADS_FAST_INPMUX_WRITE=y
CONFIG_SENSORARRAY_ADS_FAST_READ_DIRECT=y
CONFIG_SENSORARRAY_ADS_FAST_DISABLE_STATUS_CRC=y
CONFIG_SENSORARRAY_ADS_FAST_FIXED_GAIN=y
CONFIG_SENSORARRAY_ADS_SPI_POLLING_TRANSMIT=y
CONFIG_SENSORARRAY_ADS_SPI_ACQUIRE_BUS_PER_FRAME=y
CONFIG_SENSORARRAY_VOLTAGE_SCAN_OVERSAMPLE=1
CONFIG_SENSORARRAY_STATUS_PERIOD_N_FRAMES=100
CONFIG_SENSORARRAY_VOLTAGE_SCAN_OUTPUT_ERR=y
# CONFIG_SENSORARRAY_VOLTAGE_SCAN_OUTPUT_RAW is not set
# CONFIG_SENSORARRAY_VOLTAGE_SCAN_OUTPUT_GAIN is not set
# CONFIG_SENSORARRAY_VOLTAGE_SCAN_DISCARD_FIRST is not set
